# GetClOpacityN

## Description
```pascal
PROCEDURE GetClOpacityN(
				strClassName       : STRING;
				VAR outFillOpacity : INTEGER;
				VAR outPenOpacity  : INTEGER);
```

```python

def vs.GetClOpacityN(strClassName):
    return (outFillOpacity, outPenOpacity)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strClassName|STRING||
|outFillOpacity|INTEGER||
|outPenOpacity|INTEGER||

## Version
Availability: from Vectorworks 2017
## Category
* Classes